import {
  ADVANT_DIV,
  TOTAL_ADVANT_DIV,
  TOTAL_P,
  INFO_DIV,
  INFO_IMG,
  DOP_INFO_DIV,
  DOP_TITLE,
  DOP_P,
  IMG_BG_DIV,
} from './Advantages.styled';
import photo1 from './img/Крокодил_Гена_a_stocky_man_about_175_cm_tall,_with_broad_shoulde_43a73c8a-0d96-4be9-9495-e7c55b7b86ef.png';
import photo2 from './img/Крокодил_Гена_two_friends,_stocky_men_with_a_height_of_about_165_7491e639-0862-41b1-9bb1-323d9ae50242.png';
import photo3 from './img/openart-image_s63HxDq0_1739084836878_raw.png';

export const Advantages = () => {
  return (
    <ADVANT_DIV>
      <TOTAL_ADVANT_DIV>
        <TOTAL_P>Додаткова Інформація</TOTAL_P>
        <INFO_DIV>
          <INFO_IMG src={photo1} alt="photo1" />
          <DOP_INFO_DIV>
            <DOP_TITLE>Внешність і характер</DOP_TITLE>
            <DOP_P>
            Фома – коренастий чоловік зростом близько 175 см, з широкими плечима і міцними руками, закаленними роками роботи на заводі. Короткі русі волоси вже тронуті сединою, густі брови придають лицю суровий вид. Глаза серо-голубі, глибоко посажені, часто прищурені від напруги. Лицо прямоугольное, з різькими чертами, нос чуть кривоват после давней драки в молодости.

Одет завжди просто: робоча спецовка, потерта куртка, зимова — шапка-ушанка. У вільний час віддає перевагу темні джинси і шкіряну куртку, яка носить вже років десять.

В общении немногословен, но внимателен к деталям. У нього є природна спостережливість, що робить його відмінним розповідником заводських баек. В конфлікті – холоднокровен, але якщо вивести із себе, може бути небезпечно.
            </DOP_P>
          </DOP_INFO_DIV>
        </INFO_DIV>
        <INFO_DIV>
          <INFO_IMG src={photo2} alt="photo3" />
          <DOP_INFO_DIV>
            <DOP_TITLE>
            Работа и окружение</DOP_TITLE>
            <DOP_P>
Фома працює апаратником на заводі ПХЗ, де слідує за складними технологічними процесами. Робота монотонна, вимагає уваги і. На заводі він давно – майже 20 років, знає обладнання до винтика.

На роботі зблизився з чоловіками з ділянки осі. Серед них – Cтепан Шкуров , веселий балагур, завжди готовий підколоти колегу, але в потрібний момент не підведе. Олексій «Лёня» Жмакін – вугровий, молчаливий, але знає свою справу майстер. В їх компанії Фома – той, хто тримає баланс: може і пошутити, і розрулити ситуацію, якщо вдруге запахло конфліктом.
            </DOP_P>
          </DOP_INFO_DIV>
        </INFO_DIV>
        <INFO_DIV>
          <INFO_IMG src={photo3} alt="photo2" />
          <DOP_INFO_DIV>
            <DOP_TITLE>Личная жизнь</DOP_TITLE>
            <DOP_P>
            Был женат, но брак не выдержал испытания заводскими сменами и бытовыми трудностями. Є дочь – 15-річна Настя, яку він бачить раз у дві неділі, старається підтримувати її і допомагає деньгами. Після розводу воліє одиночество, хоча в заводській столовій завжди знайдеться пара жінок, які його з інтересом розглядають.
            </DOP_P>
          </DOP_INFO_DIV>
        </INFO_DIV>
      </TOTAL_ADVANT_DIV>
      <IMG_BG_DIV></IMG_BG_DIV>
    </ADVANT_DIV>
  );
};
